#!/usr/bin/env python
# coding: utf-8

# In[6]:


#리스트에 있는 값을 오름차순으로 정렬하세요
data=[2,4,3,1,5,10,9]
data.sort() #data를 오름차순으로 정렬하여라
print(data)
#값 [1, 2, 3, 4, 5, 9, 10]

data=[2,4,3,1,5,10,9]
data2= sorted(data)  #data2값을 data가 오름차순으로 정렬된거라고 지정한 후 data2를 출력하게 해도 오름차순으로 정렬된다.
print(data2)
#값 [1, 2, 3, 4, 5, 9, 10]


#번외로 리스트에 있는 값을 오름차순으로 정렬하라 하였기에 값만 오름 차순으로 정렬하면 된다면 {} 를 이용해도 간단하다.
data=[2,4,3,1,5,10,9]
data3={2,4,3,1,5,10,9}   #{}를 사용하고 값을 출력하면 자동으로 오름 차순으로 정렬된다.
print(data3)   
#값 [1, 2, 3, 4, 5, 9, 10]


# In[ ]:





# In[ ]:




